# Дана последовательность чисел. Получить список уникальных 
# элементов заданной последовательности.

subsequence = input('Введите любую последовательность чисел: ').split()
print(set(subsequence))